Repository: wolfsoft/botguard-wordpress
Catalog: src/languages/botguard-*.po
Languages: ru_ru

source: BotGuard Settings
ru_ru: Настройки BotGuard

source: Main Settings
ru_ru: Основные настройки

source: Primary Server
ru_ru: Основной сервер

source: Secondary Server
ru_ru: Дополнительный сервер

source: Primary Server name is not set.
ru_ru: Имя основного сервера не задано.

source: Primary Server has incorrect value.
ru_ru: Имя основного сервера является некорректным.

source: BotGuard configuration file %s is not writeable. Check file permissions.
ru_ru: Файл конфигурации BotGuard %s не доступен для записи. Проверьте права доступа к файлу.

source: Secondary Server name is not set.
ru_ru: Имя дополнительного сервера не задано.

source: Secondary Server has incorrect value.
ru_ru: Имя дополнительного сервера является некорректным.

source: Settings
ru_ru: Настройки

source: <p>Your <strong>wp-settings.php</strong> file was modified. Backup copy was created as <strong>wp-settings.php.bak</strong> file.</p>
ru_ru: <p>Ваш файл <strong>wp-settings.php</strong> был изменён. Резервная копия файла была создана под именем <strong>wp-settings.php.bak</strong>.</p>

source: <strong>WP Fastest Cache</strong> plugin is incompatible with BotGuard Wordpress Plugin and <strong>was deactivated</strong>
ru_ru: Плагин <strong>WP Fastest Cache</strong> несовместим с плагином BotGuard для Wordpress и <strong>был деактивирован</strong>

source: <p>To configure bot blocking options, please visit the <a href="https://botguard.net/en/website" target="_blank">BotGuard dashboard</a>.</p>
ru_ru: <p>Для настройки параметров блокировки ботов, посетите страницу <a href="https://botguard.net/ru/website" target="_blank">панели управления BotGuard</a>.</p>

source: <h4>Note</h4><p>If you will be blocked ("Forbidden"), do the following:</p><ol><li>Visit the <a href="https://botguard.net/en/website" target="_blank">BotGuard dashboard</a>, and add your IP address to whitelist on the website configuration page, or</li><li>Turn off blocking mode on the BotGuard dashboard and contact BotGuard <a href="mailto:support@botguard.net">support team</a> to resolve the issue, or</li><li>Deactivate this plugin, or</li><li>Remove this plugin manually by deleting wp-content/plugins/botguard folder.</li></ol>
ru_ru: <h4>Замечания</h4><p>Если вы будете заблокированы ("Forbidden"), сделайте следующее:</p><ol><li>Посетите <a href="https://botguard.net/ru/website" target="_blank">панель управления BotGuard</a> и добавьте свой IP адрес в белый список на странице настройки веб сайта, либо</li><li>Выключите режим блокировки в панели управления BotGuard и обратитесь в <a href="mailto:support@botguard.net">техническую поддержку</a> BotGuard для решения проблемы, либо</li><li>Деактивируйте этот плагин, либо</li><li>Удалите папку плагина wp-content/plugins/botguard вручную.</li></ol>

source: <p>The primary and secondary BotGuard server addresses assigned to your web site.</p>
ru_ru: <p>Адреса основного и дополнительного серверов BotGuard, назначенных вашему веб сайту.</p>

source: <p class="description">The address of the primary BotGuard server.</p>
ru_ru: <p class="description">Адрес основного сервера BotGuard.</p>

source: <p class="description">The address of the secondary BotGuard server.</p>
ru_ru: <p class="description">Адрес дополнительного сервера BotGuard.</p>

source: Cannot read %s file.
ru_ru: Невозможно прочитать файл %s.

source: Can't backup the wp-settings.php file. Please check %s directory permissions, it's not writeable.
ru_ru: Невозможно создать резервную копию файла wp-settings.php. Проверьте права доступа к каталогу %s, он не открыт для записи.

source: Can't overwrite wp-settings.php file. Please check file permissions, it's not writeable.
ru_ru: Невозможно перезаписать файл wp-settings.php. Пожалуйста, проверьте права доступа к файлу, он не открыт для записи.

source: BotGuard provides the service to protect your website from malicious bots, crawlers, scrapers, and hacker attacks.
ru_ru: BotGuard предоставляет сервис для защиты вашего веб сайта от вредоносных ботов, «пауков», граберов контента и хакерских атак.

source: Dennis Prochko
ru_ru: Прочко Денис
